# frozen_string_literal: true

# Добавить текстовый интерфейс:
# Создать программу в файле main.rb, которая будет позволять пользователю через текстовый интерфейс делать следующее:
# 	Создавать станции
# 	Создавать поезда
# 	Создавать маршруты и управлять станциями в нем (добавлять, удалять)
# 	Назначать маршрут поезду
# 	Добавлять вагоны к поезду
# 	Отцеплять вагоны от поезда
# 	Перемещать поезд по маршруту вперед и назад
# 	Просматривать список станций и список поездов на станции

require_relative 'interface'

Interface.new.call
