# contains hashes of cards
# Spades: 
# A^ 2^ 3^ 4^ 5^ 6^ 7^ 8^ 9^ 10^ J^ Q^ K^

# Hearts: 
# A<3 2<3 3<3 4<3 5<3 6<3 7<3 8<3 9<3 10<3 J<3 Q<3 K<3

# Diamonds: 
# A<> 2<> 3<> 4<> 5<> 6<> 7<> 8<> 9<> 10<> J<> Q<> K<>

# Clubs: 
# A+ 2+ 3+ 4+ 5+ 6+ 7+ 8+ 9+ 10+ J+ Q+ K+

module Deck
  DECK = %w(A^ 2^ 3^ 4^ 5^ 6^ 7^ 8^ 9^ 10^ J^ Q^ K^
    A<3 2<3 3<3 4<3 5<3 6<3 7<3 8<3 9<3 10<3 J<3 Q<3 K<3
    A<> 2<> 3<> 4<> 5<> 6<> 7<> 8<> 9<> 10<> J<> Q<> K<>
    A+ 2+ 3+ 4+ 5+ 6+ 7+ 8+ 9+ 10+ J+ Q+ K+)
end

module Validation
VALIDATIONS = {
  player_lost # такой метод потом можно будет использовать идиому №4 - двойное отрицание '!!'
}

end
